### DEON S

21BDA57

#### Operations in python

In [1]:
1+1

2

In [2]:
'1'+'1'

'11'

In [3]:
a=[1,2,3,4,5]

In [4]:
a

[1, 2, 3, 4, 5]

In [5]:
type(a)

list

In [6]:
b=(1,2,3,4,5)

In [7]:
b

(1, 2, 3, 4, 5)

In [8]:
type(b)

tuple

In [9]:
marks = [10, 20, 30, 50, 75, 90, 95]
pass_mark = 50
marks[0]<pass_mark

True

In [10]:
if marks[0]<pass_mark:
    print("fail")

fail

In [11]:
for i in range(len(marks)):
    print(marks[i])

10
20
30
50
75
90
95

#### if-else statements

In [14]:
for mark in marks:
    print(mark)  
    if mark<pass_mark:
        print("fail")
    else: 
        print("pass")
    print("**************\n")

10
fail
**************

20
fail
**************

30
fail
**************

50
pass
**************

75
pass
**************

90
pass
**************

95
pass
**************

In [15]:
for mark in marks:
    print(mark)  
    if(mark<pass_mark)&(mark>20):
        print("grace")
    elif(mark<pass_mark)&(mark<=20):
        print("fail")
    else: 
        print("pass")
    print("------------------")

10
fail
------------------
20
fail
------------------
30
grace
------------------
50
pass
------------------
75
pass
------------------
90
pass
------------------
95
pass
------------------

In [16]:
range(15)

range(0, 15)

In [19]:
w = range(2, 20, 4)
for n in w:
    print(n)

2
6
10
14
18

#### functions in python

In [20]:
def foo_sum(a, b):
    return a+b
foo_sum(1, 2)

3

In [21]:
def foo_diff(num1 = 0, num2 = 0):
    print(num1)
    return num1-num2
foo_diff(num1 = 10, num2 = 3)

10

7

In [22]:
foo_diff(17)

17

17

In [23]:
import pandas as pd
import numpy as np

In [24]:
marks

[10, 20, 30, 50, 75, 90, 95]

In [25]:
mark = pd.Series(marks)

In [26]:
mark

0    10
1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [27]:
mark.index

RangeIndex(start=0, stop=7, step=1)

In [28]:
mark.values

array([10, 20, 30, 50, 75, 90, 95], dtype=int64)

In [29]:
mark[4:]

4    75
5    90
6    95
dtype: int64

In [30]:
mark[:4]

0    10
1    20
2    30
3    50
dtype: int64

In [31]:
mark[:]

0    10
1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [32]:
mark[4]=None

In [33]:
mark[:]

0    10.0
1    20.0
2    30.0
3    50.0
4     NaN
5    90.0
6    95.0
dtype: float64

In [35]:
mark.value_counts()

30.0    1
20.0    1
10.0    1
50.0    1
90.0    1
95.0    1
dtype: int64

In [36]:
sample_df = pd.DataFrame([marks, marks]).T

In [37]:
sample_df

    0   1
0  10  10
1  20  20
2  30  30
3  50  50
4  75  75
5  90  90
6  95  95

In [38]:
sample_df.columns = ['marks01', 'marks02']

In [39]:
sample_df

   marks01  marks02
0       10       10
1       20       20
2       30       30
3       50       50
4       75       75
5       90       90
6       95       95

In [40]:
# reading a csv file
df = pd.read_csv("world_cup_data.csv")

In [41]:
df

,Year,Position,Country,ELO Rating,FIFA Rating,Continent,Host Country,Host Continent,Country Name
0,2010,NaN,FRA,1851.0,1044,Europe,RSA,Africa,France
1,2010,NaN,MEX,1872.0,895,South America,RSA,Africa,Mexico
2,2010,NaN,URU,1819.0,899,South America,RSA,Africa,Uruguay
3,2010,NaN,RSA,1569.0,392,Africa,RSA,Africa,South Africa
4,2010,NaN,GRE,1726.0,964,Europe,RSA,Africa,Greece
...,...,...,...,...,...,...,...,...,...
147,1994,G4,CMR,NaN,45,Africa,USA,North America,Cameroon
148,1994,G4,BOL,NaN,35,Europe,USA,North America,Bolivia
149,1994,G4,GRE,NaN,41,Europe,USA,North America,Greece
150,1994,G4,NOR,NaN,56,Europe,USA,North America,Norway
151,1994,G4,MAR,NaN,43,Africa,USA,North America,Morocco

In [42]:
df.head()

,Year,Position,Country,ELO Rating,FIFA Rating,Continent,Host Country,Host Continent,Country Name
0,2010,NaN,FRA,1851.0,1044,Europe,RSA,Africa,France
1,2010,NaN,MEX,1872.0,895,South America,RSA,Africa,Mexico
2,2010,NaN,URU,1819.0,899,South America,RSA,Africa,Uruguay
3,2010,NaN,RSA,1569.0,392,Africa,RSA,Africa,South Africa
4,2010,NaN,GRE,1726.0,964,Europe,RSA,Africa,Greece

In [43]:
df.tail()

,Year,Position,Country,ELO Rating,FIFA Rating,Continent,Host Country,Host Continent,Country Name
147,1994,G4,CMR,NaN,45,Africa,USA,North America,Cameroon
148,1994,G4,BOL,NaN,35,Europe,USA,North America,Bolivia
149,1994,G4,GRE,NaN,41,Europe,USA,North America,Greece
150,1994,G4,NOR,NaN,56,Europe,USA,North America,Norway
151,1994,G4,MAR,NaN,43,Africa,USA,North America,Morocco

In [65]:
df.index

RangeIndex(start=0, stop=152, step=1)

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            152 non-null    int64
 1   Position        120 non-null    object
 2   Country         152 non-null    object
 3   ELO Rating      32 non-null     float64
 4   FIFA  Rating    152 non-null    int64
 5   Continent       152 non-null    object
 6   Host Country    152 non-null    object
 7   Host Continent  152 non-null    object
 8   Country Name    152 non-null    object
dtypes: float64(1), int64(2), object(6)
memory usage: 10.8+ KB

In [67]:
df.dtypes

Year                int64
Position           object
Country            object
ELO Rating        float64
FIFA  Rating        int64
Continent          object
Host Country       object
Host Continent     object
Country Name       object
dtype: object

In [46]:
df['Country']

0      FRA
1      MEX
2      URU
3      RSA
4      GRE
      ...
147    CMR
148    BOL
149    GRE
150    NOR
151    MAR
Name: Country, Length: 152, dtype: object

In [47]:
type(df['Country'])

pandas.core.series.Series

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df['Country'].value_counts()

BRA    5
KOR    5
MEX    5
ITA    5
USA    5
      ..
SEN    1
TUR    1
AUT    1
ALG    1
YUG    1
Name: Country, Length: 61, dtype: int64

In [50]:
df.shape

(152, 9)

In [52]:
df.isna()

,Year,Position,Country,ELO Rating,FIFA Rating,Continent,Host Country,Host Continent,Country Name
0,False,True,False,False,False,False,False,False,False
1,False,True,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False,False
3,False,True,False,False,False,False,False,False,False
4,False,True,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
147,False,False,False,True,False,False,False,False,False
148,False,False,False,True,False,False,False,False,False
149,False,False,False,True,False,False,False,False,False
150,False,False,False,True,False,False,False,False,False
151,False,False,False,True,False,False,False,False,False

In [53]:
df.isna().sum()

Year                0
Position           32
Country             0
ELO Rating        120
FIFA  Rating        0
Continent           0
Host Country        0
Host Continent      0
Country Name        0
dtype: int64

In [59]:
df.fillna('-')

,Year,Position,Country,ELO Rating,FIFA Rating,Continent,Host Country,Host Continent,Country Name
0,2010,-,FRA,1851.0,1044,Europe,RSA,Africa,France
1,2010,-,MEX,1872.0,895,South America,RSA,Africa,Mexico
2,2010,-,URU,1819.0,899,South America,RSA,Africa,Uruguay
3,2010,-,RSA,1569.0,392,Africa,RSA,Africa,South Africa
4,2010,-,GRE,1726.0,964,Europe,RSA,Africa,Greece
...,...,...,...,...,...,...,...,...,...
147,1994,G4,CMR,-,45,Africa,USA,North America,Cameroon
148,1994,G4,BOL,-,35,Europe,USA,North America,Bolivia
149,1994,G4,GRE,-,41,Europe,USA,North America,Greece
150,1994,G4,NOR,-,56,Europe,USA,North America,Norway
151,1994,G4,MAR,-,43,Africa,USA,North America,Morocco

In [56]:
df.columns

Index(['Year', 'Position', 'Country', 'ELO Rating', 'FIFA  Rating',
       'Continent', 'Host Country', 'Host Continent', 'Country Name'],
      dtype='object')

In [68]:
new_list = ['ELO Rating', 'FIFA  Rating']
df[new_list]

     ELO Rating  FIFA  Rating
0        1851.0          1044
1        1872.0           895
2        1819.0           899
3        1569.0           392
4        1726.0           964
..          ...           ...
147         NaN            45
148         NaN            35
149         NaN            41
150         NaN            56
151         NaN            43

[152 rows x 2 columns]

In [69]:
df['Host Continent']

0             Africa
1             Africa
2             Africa
3             Africa
4             Africa
           ...
147    North America
148    North America
149    North America
150    North America
151    North America
Name: Host Continent, Length: 152, dtype: object

In [76]:
df['Host Continent'].value_counts()

Europe           64
Asia             32
Africa           32
North America    24
Name: Host Continent, dtype: int64

In [81]:
df['ELO Rating']>3

0       True
1       True
2       True
3       True
4       True
       ...
147    False
148    False
149    False
150    False
151    False
Name: ELO Rating, Length: 152, dtype: bool

In [87]:
df[(df['ELO Rating']>3)&(df['ELO Rating']<100)]

Empty DataFrame
Columns: [Year, Position, Country, ELO Rating, FIFA  Rating, Continent, Host Country, Host Continent, Country Name]
Index: []

In [88]:
df.corr()

                  Year  ELO Rating  FIFA  Rating
Year          1.000000         NaN      0.867003
ELO Rating         NaN    1.000000      0.849345
FIFA  Rating  0.867003    0.849345      1.000000

In [89]:
df.describe()

              Year   ELO Rating  FIFA  Rating
count   152.000000    32.000000    152.000000
mean   2002.421053  1776.625000    498.309211
std       5.508003   146.987546    381.814875
min    1994.000000  1531.000000     35.000000
25%    1998.000000  1689.250000     56.000000
50%    2002.000000  1752.000000    634.500000
75%    2006.000000  1863.000000    742.250000
max    2010.000000  2085.000000   1611.000000

In [70]:
list('ABCDEFG')

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [72]:
sname = list('ABCDEFG')

In [73]:
sample_dict = {'Sno':sname, 'marks':marks}
sample_dict

{'Sno': ['A', 'B', 'C', 'D', 'E', 'F', 'G'],
 'marks': [10, 20, 30, 50, 75, 90, 95]}

In [74]:
df2 = pd.DataFrame(sample_dict)

In [75]:
df2

  Sno  marks
0   A     10
1   B     20
2   C     30
3   D     50
4   E     75
5   F     90
6   G     95